# Operations

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    "Name": ["Amit", "Priya", "Ravi", "Neha"],
    "Age": [23, 21, 25, 22],
    "Marks": [85, 90, 88, 92]
})

In [3]:
df

    Name  Age  Marks
0   Amit   23     85
1  Priya   21     90
2   Ravi   25     88
3   Neha   22     92

In [4]:
# Add column
df["Grade"] = ["B", "A", "B", "A"]
df

    Name  Age  Marks Grade
0   Amit   23     85     B
1  Priya   21     90     A
2   Ravi   25     88     B
3   Neha   22     92     A

In [5]:
# Modify column
df["Marks"] = df["Marks"] + 5
df

    Name  Age  Marks Grade
0   Amit   23     90     B
1  Priya   21     95     A
2   Ravi   25     93     B
3   Neha   22     97     A

In [6]:
df["Markss"] = df["Marks"] + 5
df

    Name  Age  Marks Grade  Markss
0   Amit   23     90     B      95
1  Priya   21     95     A     100
2   Ravi   25     93     B      98
3   Neha   22     97     A     102

In [7]:
# create Another column
df["Bonus"]=df["Marks"]*0.1
df

    Name  Age  Marks Grade  Markss  Bonus
0   Amit   23     90     B      95    9.0
1  Priya   21     95     A     100    9.5
2   Ravi   25     93     B      98    9.3
3   Neha   22     97     A     102    9.7

In [8]:
# Drop column
df = df.drop("Grade", axis=1)
df

    Name  Age  Marks  Markss  Bonus
0   Amit   23     90      95    9.0
1  Priya   21     95     100    9.5
2   Ravi   25     93      98    9.3
3   Neha   22     97     102    9.7

In [25]:
df =df.drop(columns=["Marks","Age"], inplace=True, errors="ignore")
df

AttributeError: 'NoneType' object has no attribute 'drop'

In [19]:
# Rename
# inplace edit on the original dataframe
df.rename(columns={"Marks": "Score"}, inplace=True)
df

   Employ Id      Name  Age   Score    Markss  Bonus     Score
0         11      Aman   23   94.50   99.2250    9.0   99.2250
1         12     Priya   21   99.75  104.7375    9.5  104.7375
2         13  Ravinder   25   97.65  102.5325    9.3  102.5325
3         14      Neha   22  101.85  106.9425    9.7  106.9425

In [10]:
# Replace values
df["Name"] = df["Name"].replace("Amit", "Aman")
df

    Name  Age  Score  Markss  Bonus
0   Aman   23     90      95    9.0
1  Priya   21     95     100    9.5
2   Ravi   25     93      98    9.3
3   Neha   22     97     102    9.7

In [11]:
# using insert()
df.insert(0, "Employ Id", [11,12,13,14])
df

   Employ Id   Name  Age  Score  Markss  Bonus
0         11   Aman   23     90      95    9.0
1         12  Priya   21     95     100    9.5
2         13   Ravi   25     93      98    9.3
3         14   Neha   22     97     102    9.7

In [12]:
# updating the data
df.loc[2, "Name"]="Ravinder"
df

   Employ Id      Name  Age  Score  Markss  Bonus
0         11      Aman   23     90      95    9.0
1         12     Priya   21     95     100    9.5
2         13  Ravinder   25     93      98    9.3
3         14      Neha   22     97     102    9.7

In [16]:
# multiple updation
df["Score"] = df["Score"]*1.05
df

   Employ Id      Name  Age   Score  Markss  Bonus
0         11      Aman   23   94.50      95    9.0
1         12     Priya   21   99.75     100    9.5
2         13  Ravinder   25   97.65      98    9.3
3         14      Neha   22  101.85     102    9.7

In [17]:
df["Marks"] = df["Score"]*1.05
df

   Employ Id      Name  Age   Score  Markss  Bonus     Marks
0         11      Aman   23   94.50      95    9.0   99.2250
1         12     Priya   21   99.75     100    9.5  104.7375
2         13  Ravinder   25   97.65      98    9.3  102.5325
3         14      Neha   22  101.85     102    9.7  106.9425

In [18]:
df["Markss"] = df["Score"]*1.05
df

   Employ Id      Name  Age   Score    Markss  Bonus     Marks
0         11      Aman   23   94.50   99.2250    9.0   99.2250
1         12     Priya   21   99.75  104.7375    9.5  104.7375
2         13  Ravinder   25   97.65  102.5325    9.3  102.5325
3         14      Neha   22  101.85  106.9425    9.7  106.9425